## Tutorial Python

### Funções
---------------------------------------------------------------

In [1]:
def getCount(inputStr):
    return sum(1 for letter in inputStr if letter in ('aeiouAEIOU'))

getCount('Boa noite a todos')

In [2]:
def getCountSpace(inputStr):
    return sum(1 for letter in inputStr if letter in (' '))

getCountSpace('Boa noite a todos')

In [3]:
sandwich = ['bun', 'beef', 'tomato', 'ketchup', 'bun']

def whats_on_the_sandwich(sandwich):
    for um_ingrediente in sandwich:
        print(f'O sanduiche é feito com {um_ingrediente}')
        
whats_on_the_sandwich(sandwich)

### Importação
---------------------------------------------------------------

In [4]:
from math import pi

def getCirc(rad):
    return 2*(pi*(rad**2))

print(getCirc(20))

In [5]:
import numpy as np

np.zeros(10)

### Operadores de Associação e Identidade
---------------------------------------------------------------

In [6]:
# Associação
y = ['1', '2', 3]
x = 1

In [7]:
x in y

In [8]:
x not in y

In [9]:
# Identidade
y = ['1', '2', 3, '4']
x = '4'

In [10]:
x is y

False

In [11]:
x is not y

True

### Numpy
---------------------------------------------------------------

In [12]:
import numpy as np

np_height = np.array([1.73, 1.68, 1.71, 1.89, 1.79])
np_weight = np.array([65.4, 59.2, 63.6, 88.4, 68.7])
bmi = np_weight / np_height ** 2

print(bmi)

print(bmi[(bmi > 21) & (bmi < 22)])

print(bmi[np.logical_and(bmi > 21, bmi < 22)])

[21.85171573 20.97505669 21.75028214 24.7473475  21.44127836]
[21.85171573 21.75028214 21.44127836]
[21.85171573 21.75028214 21.44127836]

### DataFrames
---------------------------------------------------------------

In [13]:
import io
import requests
import pandas as pd

url="https://raw.githubusercontent.com/wblakecannon/DataCamp/master/02-intermediate-python-for-data-science/_datasets/brics.csv"

s = requests.get(url).content
brics = pd.read_csv(io.StringIO(s.decode('utf-8')), index_col=0)

display(brics)

         country    capital    area  population
BR        Brazil   Brasilia   8.516      200.40
RU        Russia     Moscow  17.100      143.50
IN         India  New Delhi   3.286     1252.00
CH         China    Beijing   9.597     1357.00
SA  South Africa   Pretoria   1.221       52.98

In [14]:
brics.describe()

            area   population
count   5.000000     5.000000
mean    7.944000   601.176000
std     6.200557   645.261454
min     1.221000    52.980000
25%     3.286000   143.500000
50%     8.516000   200.400000
75%     9.597000  1252.000000
max    17.100000  1357.000000

In [15]:
brics.dtypes

country        object
capital        object
area          float64
population    float64
dtype: object

In [16]:
brics[brics['area'] > 8].country[0]

'Brazil'

In [17]:
import io
import requests
import pandas as pd

url="https://gist.githubusercontent.com/noamross/e5d3e859aa0c794be10b/raw/b999fb4425b54c63cab088c0ce2c0d6ce961a563/cars.csv"

s = requests.get(url).content
cars = pd.read_csv(io.StringIO(s.decode('utf-8')),  index_col=0)

display(cars.head(4))
display(cars.dtypes)

                 mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
Mazda RX4       21.0    6  160.0  110  3.90  2.620  16.46   0   1     4     4
Mazda RX4 Wag   21.0    6  160.0  110  3.90  2.875  17.02   0   1     4     4
Datsun 710      22.8    4  108.0   93  3.85  2.320  18.61   1   1     4     1
Hornet 4 Drive  21.4    6  258.0  110  3.08  3.215  19.44   1   0     3     1

mpg     float64
cyl       int64
disp    float64
hp        int64
drat    float64
wt      float64
qsec    float64
vs        int64
am        int64
gear      int64
carb      int64
dtype: object

In [18]:
cars[(cars['cyl'] > 6)].loc[:, ['cyl']]

                     cyl
Hornet Sportabout      8
Duster 360             8
Merc 450SE             8
Merc 450SL             8
Merc 450SLC            8
Cadillac Fleetwood     8
Lincoln Continental    8
Chrysler Imperial      8
Dodge Challenger       8
AMC Javelin            8
Camaro Z28             8
Pontiac Firebird       8
Ford Pantera L         8
Maserati Bora          8

In [19]:
cars[(cars['disp'] > 200) & (cars['am'] == 0)].loc[:, ['disp', 'am']]

                      disp  am
Hornet 4 Drive       258.0   0
Hornet Sportabout    360.0   0
Valiant              225.0   0
Duster 360           360.0   0
Merc 450SE           275.8   0
Merc 450SL           275.8   0
Merc 450SLC          275.8   0
Cadillac Fleetwood   472.0   0
Lincoln Continental  460.0   0
Chrysler Imperial    440.0   0
Dodge Challenger     318.0   0
AMC Javelin          304.0   0
Camaro Z28           350.0   0
Pontiac Firebird     400.0   0

In [20]:
cars[(cars['vs'] == 1) & (cars['gear']%2 != 0)].loc[:, ['vs', 'gear']]

                vs  gear
Hornet 4 Drive   1     3
Valiant          1     3
Toyota Corona    1     3
Lotus Europa     1     5

In [21]:
import io
import requests
import pandas as pd

url="https://raw.githubusercontent.com/plotly/datasets/master/school_earnings.csv"

s = requests.get(url).content
school = pd.read_csv(io.StringIO(s.decode('utf-8')))

In [22]:
display(school.head(4))
display(school.dtypes)

     School  Women  Men  Gap
0       MIT     94  152   58
1  Stanford     96  151   55
2   Harvard    112  165   53
3    U.Penn     92  141   49

School    object
Women      int64
Men        int64
Gap        int64
dtype: object

In [23]:
# Quantidade de Escolas?
school['School'].count()
len(school.School.unique())

21

In [24]:
# Escolas em que Gap maior do que 45
school[school['Gap'] > 45].School
school[school['Gap'] > 45]['School']

0          MIT
1     Stanford
2      Harvard
3       U.Penn
4    Princeton
Name: School, dtype: object

In [25]:
# Escolas em que somatorio de men e women é maior do que 200
school[school['Men'] + school['Women'] > 200].School

0            MIT
1       Stanford
2        Harvard
3         U.Penn
4      Princeton
6     Georgetown
9       Columbia
10          Duke
Name: School, dtype: object

In [26]:
# Conte quantas escolas possuem valor na coluna women menor do que 77 e quantos é maior do que 77
print(school[school['Women'] < 77].School.count())
print(school[school['Women'] > 77].School.count())

9
12

### Correlação
---------------------------------------------------------------
##### Interdependência entre uma ou mais variáveis (features)

In [27]:
# Informaçõe estatísticas
cars.describe().T

,count,mean,std,min,25%,50%,75%,max
mpg,32.0,20.090625,6.026948,10.400,15.42500,19.200,22.80,33.900
cyl,32.0,6.187500,1.785922,4.000,4.00000,6.000,8.00,8.000
disp,32.0,230.721875,123.938694,71.100,120.82500,196.300,326.00,472.000
hp,32.0,146.687500,68.562868,52.000,96.50000,123.000,180.00,335.000
drat,32.0,3.596563,0.534679,2.760,3.08000,3.695,3.92,4.930
wt,32.0,3.217250,0.978457,1.513,2.58125,3.325,3.61,5.424
qsec,32.0,17.848750,1.786943,14.500,16.89250,17.710,18.90,22.900
vs,32.0,0.437500,0.504016,0.000,0.00000,0.000,1.00,1.000
am,32.0,0.406250,0.498991,0.000,0.00000,0.000,1.00,1.000
gear,32.0,3.687500,0.737804,3.000,3.00000,4.000,4.00,5.000
carb,32.0,2.812500,1.615200,1.000,2.00000,2.000,4.00,8.000

In [28]:
#!pip install pandas_profiling

In [ ]:
from pandas_profiling import ProfileReport

profile = ProfileReport(cars, title='Pandas Profile')

profile.to_widgets()

HBox(children=(HTML(value='Summarize dataset'), FloatProgress(value=0.0, max=25.0), HTML(value='')))

In [ ]:
import numpy as np
# Definição de números aleatórios
np.random.seed(1)

# 1000 num aleatórios de 0 - 100
x = np.random.randint(0,50,1000)

# 1000 num aleatórios por uma distribuição normal de 0 - 100
y = x + np.random.normal(0,10,1000)

np.corrcoef(x,y)

In [ ]:
import matplotlib.pyplot as plt
plt.scatter(x,y)

- Correlação positiva

In [ ]:
x = np.random.randint(0,50,1000)
y = 100 - x + np.random.normal(0,3,1000)

np.corrcoef(x,y)

In [ ]:
import matplotlib.pyplot as plt
plt.scatter(x,y)

- Correlação negativa

In [ ]:
x = np.random.randint(0,50,1000)
y = np.random.randint(0,50,1000)

np.corrcoef(x,y)

In [ ]:
import matplotlib.pyplot as plt
plt.scatter(x,y)

- Correlação fraca ou sem correlação